["Кето-диета или кетогенная диета — это образ питания, который включает в себя употребление пищи с низким содержанием углеводов и высоким содержанием жиров, в результате которой происходит более быстрое снижение массы тела. Эта диета имеет много преимуществ для здоровья, что было продемонстрировано в более чем пятидесяти исследованиях. Кето-диета входит в медицинские рекомендации, и может быть полезна для снижения массы тела без ощущения сильного голода и для контроля сахарного диабета 2 типа.", "Энергия для работы организма поступает из употребляемой нами пищи. Основные получаемые организмом из пищи компоненты — это жиры, белки, углеводы. Их наш организм перерабатывает до более простых молекул: углеводы – до глюкозы, белки – до аминокислот, жиры – до глицерина и жирных кислот. При этом основным «топливом» для нас является именно глюкоза, в которую могут превращаться все остальные. Однако во время голодания или в условиях кетогенной диеты синтезируемые в печени кетоновые тела становятся основным источником энергии. Кетоновые тела являются для организма альтернативным источником энергии, который используется при недостатке глюкозы. Кетоны образуются при условии, если человек с пищей употребляет малое количество углеводов, которые быстро распадаются на глюкозу, и небольшое количество белка (избыток белка также преобразовывается в конечном счете в глюкозу). В условиях кето-диеты, так как потребление углеводов происходит в низких дозах, организм для получения энергии начинает активно расщеплять жировые запасы с образованием большого количества кетоновых тел.", "Чтобы быстро войти в кетоз, надо ограничить употребление углеводов до низкого уровня, предпочтительно ниже 20 граммов в день.", "Существует три способа измерения кетонов:1.Тест-полоски для анализа мочи; 2.Анализатор уровня кетонов с выдыхаемым воздухом; 3.Измеритель уровня кетонов в крови.", "Большинство людей испытывают симптомы «кето-гриппа». Вот список того, что вы можете почувствовать - в большей или меньшей степени, - через несколько дней после начала кето-диеты: Головная боль, Усталость, Головокружение, Лёгкая тошнота, Рассредоточенность внимания, Недостаток мотивации, Раздражительность. Симптомы обыкновенно исчезают в течение недели, когда ваш организм адаптируется к получению энергии из жиров. Причина «кето-гриппа» точно неизвестна. Существуют предположения, что эти проявления связаны с обезвоживанием на фоне повышения образования и выделения кетоновых тел. Также среди возможных причин называют иммунологическую реакцию и изменение кишечной микробиоты.Как правило, проявления «кето-гриппа» затрагивают людей, чье питание было относительно «нездоровым» (в частности, содержало много быстроусваиваемых углеводов). Вы можете уменьшить и даже устранить эти симптомы, убедившись, что вы получаете достаточное количество жидкости и соли.Простой способ сделать это—выпивать чашку бульона 1-2 раза в день.", "Если вы не пьете достаточное количество воды и не получаете достаточное количество электролитов, таких как соль, вы можете ощущать сухость во рту. Попробуйте употреблять 1-2 чашки бульона в день, плюс столько воды, сколько вам нужно. Вы также можете ощущать металлический привкус во рту.", "Кетоновые тела при возрастании их концентрации могут преодолевать почечный порог и попадать в мочу, что позволяет проводить тестирования на определение кетоза с использованием тест-полосок для мочи. Из-за того, что с кетоновыми телами в мочу «затягивает» больше воды по осмотическому градиенту, учащается мочеиспускание и усиливается жажда.", "Кетоновое тело, называемое ацетоном, попадает в выдыхаемый воздух. Из-за него дыхание человека может пахнуть «фруктами» или быть похожим по запаху на жидкость для снятия лака. Этот же запах может исходить от пота. После выхода из состояния кетоза запах исчезнет.", "Многие люди отмечают заметное снижение аппетита на кето-диете. Многие люди на кетогенной диете чувствуют себя прекрасно, когда едят один или два раза в день, и могут в итоге автоматически перейти на интервальное голодание, которое экономит время и деньги, а также ускоряет потерю веса.", "После нескольких дней чувства усталости («кето-грипп») многие люди испытывают явное повышение уровня энергии, которое может проявляться в повышении ясности мышления, вместо «затуманенного рассудка» или даже возникновении ощущения эйфории.", "Для большинства людей кето-диета является безопасной. Однако в некоторых ситуациях она противопоказана при следующих заболеваниях и состояниях: Сахарный диабет 1 типа, Беременность и лактация, Панкреатит, Печеночная недостаточность, Почечная недостаточность, Первичный дефицит карнитина, Дефицит ферментов карнитин-пальмитоилтрансферазы, карнитин-транслазы, пируваткиназы, Порфирия, Хронические болезни желудочно-кишечного тракта. Ограничением к кето-диете является:Прием сахароснижающих препаратов.Предупреждение! Обсудите с врачом любые изменения в лечении и образе жизни.", "1.Ограничьте потребление углеводов до 20 граммов в день или меньше: соблюдайте строгую диету с низким содержанием углеводов. При этом клетчатку ограничивать не надо, она может быть полезна для кетоза.Часто одного только ограничения углеводов достаточно, чтобы привести организм в состояние кетоза. Но остальная часть списка поможет вам добиться еще большего успеха. Наши рецепты рассчитаны на количество углеводов до 20 граммов в день и не требуют их подсчета.", "2.Ограничьте те белок до умеренного количества. Кето-диета не является белковой диетой. Это связано с тем, что избыток белка в организме превращается в глюкозу. Старайтесь придерживаться употребления примерно 1,5 граммов белка в день на килограмм вашего веса. Распространённой ошибкой, мешающей людям вызывать у себя кетоз, является употребление слишком большого количества белка. Наши кето-рецепты разработаны с учетом необходимого количества белка.", "3.Потребляйте достаточно жиров. Кето-диета – это диета с высоким содержанием жиров. Есть разница между кето-диетой и голоданием, которое также приводит к кетозу: диеты легче придерживаться в течение более длительного времени. При длительном голодании мы можем ощущать усталость и голод, в то время как кетогенная диета более устойчива и позволяет нам сохранять хорошее самочувствие. Если на фоне кето-диеты вас преследует чувство голода, вам стоит добавлять больше жира в пищу (например, больше масла). Наши кето-рецепты разработаны содержащими необходимые пропорции жира.", "4.Избегайте перекусов, когда не ощущаете сильного голода. Если питаться чаще, чем нужно, просто для удовольствия и потому, что вокруг есть еда, это приведёт к уменьшению кетоза и замедлит снижение массы тела. Но перекусы нормальны, когда вы испытываете голод.", "5. При необходимости можно добавить интервальное голодание. Например, пропустить завтрак и употреблять пищу только в течение восьмичасового окна, голодая в течение остальных шестнадцати часов (схема 16:8). Это очень эффективно для повышения уровня кетонов, а также для ускорения снижения веса и контроля сахарного диабета 2 типа.", "6.Добавьте упражнения — добавление любого вида физической активности может значительно увеличить уровень кетонов в организме. Упражнения также помогают ускорить снижение веса и улучшить контроль сахарного диабета 2 типа.", "7.Спите достаточно количество часов и снижайте уровень стресса. Для большинства людей требуется не менее 7 часов сна в сутки. Недостаток сна может затруднить соблюдение кето-диеты из-за своего влияния на пищевое поведение, снизить самоконтроль и сделать вас податливым искушениям ненужной лишней еды."]